In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
from word2number import w2n

In [37]:
data = pd.read_csv("hiring.csv")
data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
data['experience']=data['experience'].fillna('zero')
data['test_score(out of 10)']=data['test_score(out of 10)'].fillna(data['test_score(out of 10)'].mean())

data

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero               8.000000                           9      50000
1       zero               8.000000                           6      45000
2       five               6.000000                           7      60000
3        two              10.000000                          10      65000
4      seven               9.000000                           6      70000
5      three               7.000000                          10      62000
6        ten               7.857143                           7      72000
7     eleven               7.000000                           8      80000

In [16]:
number = data['experience'].to_list()
print(number)
lis = []

for num in number:
    lis.append(w2n.word_to_num(num))

data['experience']=pd.Series(lis)
data

['zero', 'zero', 'five', 'two', 'seven', 'three', 'ten', 'eleven']

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0               8.000000                           9      50000
1           0               8.000000                           6      45000
2           5               6.000000                           7      60000
3           2              10.000000                          10      65000
4           7               9.000000                           6      70000
5           3               7.000000                          10      62000
6          10               7.857143                           7      72000
7          11               7.000000                           8      80000

In [32]:
from sklearn import linear_model
reg = linear_model.LinearRegression()
model = reg.fit(data[['experience','test_score(out of 10)','interview_score(out of 10)']],data[['salary($)']])

In [31]:
reg.predict(data[['experience','test_score(out of 10)','interview_score(out of 10)']])

array([[52313.61238494],
       [45722.68644263],
       [58231.95591138],
       [63991.7318464 ],
       [67429.06277517],
       [61080.55179794],
       [75922.72532666],
       [79307.67351488]])

In [ ]:
reg.predict([[12,10,10]])

c:\Users\hsd28\AppData\Local\Programs\Python\Python312\Lib\site-packages\sklearn\base.py:493: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[92268.07227784]])